package client.wlx.dto

class Region {

}

object Region {


  val Ukraine = Map(
    "80" -> "Київ",
    "07" -> "Волинська область",
    "68" -> "Хмельницька область",
    "05" -> "Вінницька область",
    "35" -> "Кіровоградська область",
    "65" -> "Херсонська область",
    "63" -> "Харківська область",
    "01" -> "Автономна Республіка Крим",
    "32" -> "Київська область",
    "61" -> "Тернопільська область",
    "18" -> "Житомирська область",
    "48" -> "Миколаївська область",
    "46" -> "Львівська область",
    "14" -> "Донецька область",
    "44" -> "Луганська область",
    "74" -> "Чернігівська область",
    "12" -> "Дніпропетровська область",
    "73" -> "Чернівецька область",
    "71" -> "Черкаська область",
    "59" -> "Сумська область",
    "26" -> "Івано-Франківська область",
    "56" -> "Рівненська область",
    "85" -> "Севастополь",
    "23" -> "Запорізька область",
    "53" -> "Полтавська область",
    "21" -> "Закарпатська область",
    "51" -> "Одеська область"
  )


}


